let globalData = getApp().globalData;
const app = getApp()
Page({
  data: {
    version: '1.0.10',
    logList: [{
      version: "start",
      date: "2020-09-23",
      log: ["由于太过无聊和空闲，开始了这款工具小程序。"]
    },  {
      version: "1.0.0",
      date: "2020-09-24",
      log: ["1.新增天气功能，查看全国天气、指数等等。", "2.新增日历功能，就是个日历。","3.新增附件导航功能，查看美食、地铁、商城等等。", ]
    },  {
      version: "1.0.1",
      date: "2020-09-25",
      log: ["1.新增归属地查询，查ip、身份证和手机号。","2.新增归属地查询，查ip、身份证和手机号。", "3.新增电话本功能，查询常用紧急、公共服务等电话，一键拨号。"]
    }, {
      version: "1.0.2",
      date: "2020-09-27",
      log: ["1.新增幸运签功能，每日一句话以及宜忌。","2.新增历史上的今天，查看历史上的今天发生了什么。", "3.新增周公解梦，解答各种梦境含义。", "4.新增星座运势查询，查询今日星座运势。","5.新增天气背景图片切换，彩蛋效果，输入‘艾维’或‘520’触发。"]
    },{
      version: "1.0.3",
      date: "2020-09-28",
      log: ["1.新增有趣AI，主要有动物、植物识别。","2.新增百度翻译，提供翻译查询。"]
    },{
      version: "1.0.4",
      date: "2020-09-29",
      log: ["1.新增有趣AI，主要有货币、菜品、logo、红酒识别。","2.新增照片特效AI，主要有图片风格转换、人像动漫化、黑白照片上色。","3.新增语音合成，可选人物、语速、音量等等。"]
    },{
      version: "1.0.5",
      date: "2020-10-01",
      log: ["1.新增取名功能，选择指定条件，生成你想要的名字。","2.新增生日性格，选择出生日期，测试你的什么性格。","3.新增星座匹配，查看你最适合的星座。","4.新增脑筋急转弯，头脑风暴现在开始。"]
    },{
      version: "1.0.6",
      date: "2020-10-03",
      log: ["1.新增智能春联，输入关键字，生成春联。","2.新增AI写诗，输入关键字，生成七言绝句一首。"]
    },{
      version: "1.0.7",
      date: "2020-10-04",
      log: ["1.新增2021运势查询，根据名字查询你新年的运势如何。","2.新增新年祝福云，选择对象以及性别，自动生成祝福语。"]
    },{
      version: "1.0.8",
      date: "2020-10-11",
      log: ["1.新增后浪文学，包括土味情话、精神语录、网易云热评、舔狗日记、诗词语录、哲学语录、开车段子。","2.新增颜值在线，拍照识别颜值是多少。","3.新增睡眠Music，夜深人静睡不着，不然试试睡眠Music"]
    },{
      version: "1.0.9",
      date: "2020-10-13",
      log: ["1.新增全国大学，搜索大学，进行对比。","2.修复bug，重构页面。","3.删除语音合成，因为百度要收钱了"]
    },{
      version: "1.0.10",
      date: "2020-10-26",
      log: ["1.新增手持弹幕功能。","2.新增恶搞来电功能。","3.新增体质指数计算器功能。","4.新增壁纸功能。","5.重构个人中心页面，增加更新日志。"]
    },].reverse()
  },
  onLoad: function(options) {

  },
  getLink(e) {
    let link = e.currentTarget.dataset.link
    wx.setClipboardData({
      data: link,
      success(res) {
        wx.getClipboardData({
          success(res) {
            app.toast("链接已复制", 2000, true)
          }
        })
      }
    })
  }
})